УТ_для_edt/src/DataProcessors/смартОприходованиеГарантийныхЗапчастей/смартОприходованиеГарантийныхЗапчастей.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>смартОприходованиеГарантийныхЗапчастей</name>
  <comment>// смарт:ММ #044 224 137 26.11.2020</comment>
  <tabularSections>
    <name>Запчасти</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Отметка</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоОжидается</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоПришло</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерЗаявки</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Склад</name>
      <type>
        <types>CatalogRef.Склады</types>
      </type>
    </attributes>
    <attributes>
      <name>ЗаявкаНаГарантийныйРемонт</name>
      <type>
        <types>DocumentRef.смартЗаявкаНаГарантийныйРемонт</types>
      </type>
    </attributes>
    <attributes>
      <name>НомерПозиции</name>
      <comment>ИД строки из табличной части ЗаполняетсяСпециалистомПоПретензиям</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ИДСтрокиЗаполняетсяИнженером</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:DataProcessor>

УТ_для_edt/src/DataProcessors/смартОприходованиеГарантийныхЗапчастей/Forms/Форма/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	НастроитьВидимостьДоступность();
	
	ЗаполнитьНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура Заполнить(Команда)
	ЗаполнитьНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ОприходоватьНаСклад(Команда)
	
	// Пока просто ругается, без запретов
	ПроверитьНулевоеКоличествоПришло();
	
	ОприходоватьНаСкладСервер();
	
КонецПроцедуры


&НаСервере
Процедура НастроитьВидимостьДоступность()
	
	МассивИменКолонок = Новый Массив;
	
	МассивИменКолонок.Добавить("НоменклатураАртикул");
	МассивИменКолонок.Добавить("Номенклатура");
	МассивИменКолонок.Добавить("Отметка");
	МассивИменКолонок.Добавить("КоличествоОжидается");
	//МассивИменКолонок.Добавить("КоличествоПришло");  // Она доступна всем и так
	МассивИменКолонок.Добавить("НомерЗаявки");
	МассивИменКолонок.Добавить("Склад");
	
	Если РольДоступна("ПолныеПрава") Тогда
		Для Каждого Имя Из МассивИменКолонок Цикл
			Элементы["Запчасти" + Имя].ТолькоПросмотр = Ложь;
		КонецЦикла;	
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьНаСервере()
	
	Об = РеквизитФормыВЗначение("Объект");
	Об.ЗаполнитьНаСервере();
	ЗначениеВРеквизитФормы(Об, "Объект");
		
КонецПроцедуры

&НаКлиенте
Процедура ПроверитьНулевоеКоличествоПришло()
	
	Отбор = Новый Структура;
	Отбор.Вставить("Отметка", Истина);
	Отбор.Вставить("КоличествоПришло", 0);
	НайденныеСтроки = Объект.Запчасти.НайтиСтроки(Отбор);
	
	Для Каждого Стр Из НайденныеСтроки Цикл
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("В строке " + Стр.НомерСтроки + " не заполнена колонка ""Количество пришло""");
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ОприходоватьНаСкладСервер()
	
	Об = РеквизитФормыВЗначение("Объект");
	Об.ОприходоватьНаСкладСервер();	
	
КонецПроцедуры
